nc: 10 # 换成你的类别数
scales:
  n: [0.50, 0.25, 1024] 

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]         # 0
  - [-1, 1, Conv, [128, 3, 2]]        # 1
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]        # 3
  - [-1, 2, C3k2, [512, False, 0.25]] # 4 (极其关键的 P3 特征)
  - [-1, 1, Conv, [512, 3, 2]]        # 5
  - [-1, 2, C3k2, [512, True]]        # 6 (极其关键的 P4 特征)
  - [-1, 1, Conv, [1024, 3, 2]]       # 7
  - [-1, 2, C3k2, [1024, True]]       # 8
  - [-1, 1, SPPF, [1024, 5]]          # 9
  - [-1, 1, DLKA, [1024]]             # 10 🌟 插入 DLKA，前面 0-9 的编号不受任何影响！
  - [-1, 2, C2PSA, [1024]]            # 11 (原先是 10)

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 6], 1, Concat, [1]]                  # 13 🌟 修正：恢复连接到 6！
  - [-1, 2, C3k2, [512, False]]                # 14
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]]                  # 16 🌟 修正：恢复连接到 4！
  - [-1, 2, C3k2, [256, False]]                # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                 # 18
  - [[-1, 14], 1, Concat, [1]]                 # 19 🌟 修正：连接到 14 (原先的 13 顺延)
  - [-1, 2, C3k2, [512, False]]                # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                 # 21
  - [[-1, 11], 1, Concat, [1]]                 # 22 🌟 修正：连接到 11 (原先的 10 顺延)
  - [-1, 2, C3k2, [1024, True]]                # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]            # 24 🌟 输出层对应 17, 20, 23