nc: 10 # 换成你的类别数
scales:
  n: [0.50, 0.25, 1024] 

backbone:
  # 🌟 0-10层：100% 官方原汁原味，完美继承预训练权重
  - [-1, 1, Conv, [64, 3, 2]]         # 0
  - [-1, 1, Conv, [128, 3, 2]]        # 1
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]        # 3
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]        # 5
  - [-1, 2, C3k2, [512, True]]        # 6
  - [-1, 1, Conv, [1024, 3, 2]]       # 7
  - [-1, 2, C3k2, [1024, True]]       # 8
  - [-1, 1, SPPF, [1024, 5]]          # 9
  - [-1, 2, C2PSA, [1024]]            # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]]                  # 12
  - [-1, 2, C3k2, [512, False]]                # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]]                  # 15
  - [-1, 2, C3k2, [256, False]]                # 16 (P3 小目标特征)
  - [-1, 1, EMA, [64]]                        # 17 🌟 注入 EMA，精炼近处大尺寸路沿！

  - [-1, 1, Conv, [256, 3, 2]]                 # 18
  - [[-1, 13], 1, Concat, [1]]                 # 19
  - [-1, 2, C3k2, [512, False]]                # 20 (P4 中目标特征)
  - [-1, 1, EMA, [128]]                        # 21 🌟 注入 EMA，精炼中距离路沿！

  - [-1, 1, Conv, [512, 3, 2]]                 # 22
  - [[-1, 10], 1, Concat, [1]]                 # 23
  - [-1, 2, C3k2, [1024, True]]                # 24 (P5 大目标特征)
  - [-1, 1, EMA, [256]]                       # 25 🌟 注入 EMA，精炼极远处的消失点特征！

  - [[17, 21, 25], 1, Detect, [nc]]            # 26 🌟 输出层对应三个 EMA 的输出